#Найдите сумму цифр трехзначного числа.

# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

n = input()
n = int (n)
a = n // 100
b = n % 100 // 10
c = n % 10
sum = a + b + c
print(f"{n} = {sum}")